<template>
  <div class="example">
    <slide 
      v-if="pics.length > 0" 
      :duration="300" 
      effect="ease" 
      :init-index="1" 
      :loop="false" 
      :auto="false" 
      :show-page-index="false" 
      :bound-rate="0.1" 
      :slide-change="slideChange" 
      :is-fullscreen="isFullscreen">

      <div class="slide-item" v-for="item in pics">
        <!-- <img :src="item" @click="toggleFullscreen"> -->
        <img :src="item">
        <p>1月21日举行的省部级主要领导干部坚持底线思维着力防范化解重大风险专题研讨班开班式上，习近平提出“提高防控能力着力防范化解重大风险，保持经济持续健康发展社会大局稳定”的要求。

　　习近平深谙“忧劳可以兴国，逸豫可以亡身”的历史规律，他告诫广大领导干部要增强忧患意识，“图之于未萌，虑之于未有”；针对各种可能的风险，他指出要“心中有数、对症下药”；对于各级领导干部，要求“以‘踏平坎坷成大道，斗罢艰险又出发’的顽强意志，应对好每一场重大风险挑战，切实把改革发展稳定各项工作做实做好”。

　　图之于未萌，虑之于未有

　　“安而不忘危，存而不忘亡，治而不忘乱。”越是在愈进愈难而又非进不可的关键时刻，越要把防风险摆在突出位置。习近平时刻提醒广大领导干部要增强忧患意识。

　　●增强忧患意识，做到居安思危，是我们治党治国必须始终坚持的一个重大原则。我们党要巩固执政地位，要团结带领人民坚持和发展中国特色社会主义，保证国家安全是头等大事。

　　——2014年4月15日，在中央国家安全委员会第一次会议上的讲话

　　●如果发生重大风险又扛不住，国家安全就可能面临重大威胁，全面建成小康社会进程就可能被迫中断。我们必须把防风险摆在突出位置，“图之于未萌，虑之于未有”，力争不出现重大风险或在出现重大风险时扛得住、过得去。

　　——2015年10月29日，在党的十八届五中全会第二次全体会议上的讲话

　　●“明者防祸于未萌，智者图患于将来。”我们必须积极主动、未雨绸缪，见微知著、防微杜渐，下好先手棋，打好主动仗，做好应对任何形式的矛盾风险挑战的准备，做好经济上、政治上、文化上、社会上、外交上、军事上各种斗争的准备，层层负责、人人担当。

　　——2016年1月18日，在省部级主要领导干部学习贯彻党的十八届五中全会精神专题研讨班上的讲话

　　●面对波谲云诡的国际形势、复杂敏感的周边环境、艰巨繁重的改革发展稳定任务，我们必须始终保持高度警惕，既要高度警惕“黑天鹅”事件，也要防范“灰犀牛”事件；既要有防范风险的先手，也要有应对和化解风险挑战的高招；既要打好防范和抵御风险的有准备之战，也要打好化险为夷、转危为机的战略主动战。

　　——2019年1月21日，在省部级主要领导干部坚持底线思维着力防范化解重大风险专题研讨班开班式上的讲话

　　心中有数、对症下药

　　心中有数才能工作有方。必须全面充分认识风险，才能做到“任凭风浪起，稳坐钓鱼船”。为此，习近平要求我们面对各种可能的风险及其原因要做到心中有数、对症下药。

　　●我们要赢得优势、赢得主动、赢得未来，必须不断提高运用马克思主义分析和解决实际问题的能力，不断提高运用科学理论指导我们应对重大挑战、抵御重大风险、克服重大阻力、化解重大矛盾、解决重大问题的能力，以更宽广的视野、更长远的眼光来思考把握未来发展面临的一系列重大问题，不断坚定马克思主义信仰和共产主义理想。

　　——2018年5月4日，在纪念马克思诞辰200周年大会上的讲话

　　●要加强对各种风险源的调查研判，提高动态监测、实时预警能力，推进风险防控工作科学化、精细化，对各种可能的风险及其原因都要心中有数、对症下药、综合施策，出手及时有力，力争把风险化解在源头，不让小风险演化为大风险，不让个别风险演化为综合风险，不让局部风险演化为区域性或系统性风险，不让经济风险演化为社会政治风险，不让国际风险演化为国内风险。

　　——2015年10月29日，在党的十八届五中全会第二次全体会议上的讲话

　　●我们要坚持以供给侧结构性改革为主线，积极转变发展方式、优化经济结构、转换增长动力，积极扩大内需，实施区域协调发展战略，实施乡村振兴战略，坚决打好防范化解重大风险、精准脱贫、污染防治的攻坚战。

　　——2018年12月18日，在庆祝改革开放40周年大会上的讲话

　　●领导干部要加强理论修养，深入学习马克思主义基本理论，学懂弄通做实新时代中国特色社会主义思想，掌握贯穿其中的辩证唯物主义的世界观和方法论，提高战略思维、历史思维、辩证思维、创新思维、法治思维、底线思维能力，善于从纷繁复杂的矛盾中把握规律，不断积累经验、增长才干。要完善风险防控机制，建立健全风险研判机制、决策风险评估机制、风险防控协同机制、风险防控责任机制，主动加强协调配合，坚持一级抓一级、层层抓落实。

　　——2019年1月21日，在省部级主要领导干部坚持底线思维着力防范化解重大风险专题研讨班开班式上的讲话

　　踏平坎坷成大道，斗罢艰险又出发

　　知难而进方显勇毅。以充沛顽强的斗争精神，把防范化解重大风险的各项工作真正落到实处，中华民族走向伟大复兴的脚步将更加坚实铿锵。

　　●从任务看，抓重点、补短板、强弱项还有不少难关要过，特别是要坚决打好防范化解重大风险、精准脱贫、污染防治的攻坚战。完成非凡之事，要有非凡之精神和行动。决胜就是冲锋号，就是总动员。

　　——2017年10月25日，在党的十九届一中全会上的讲话

　　●各级领导班子和领导干部要加强斗争历练，增强斗争本领，永葆斗争精神，以“踏平坎坷成大道，斗罢艰险又出发”的顽强意志，应对好每一场重大风险挑战，切实把改革发展稳定各项工作做实做好。

　　——2019年1月21日，在省部级主要领导干部坚持底线思维着力防范化解重大风险专题研讨班开班式上的讲话

　　●领导干部要敢于担当、敢于斗争，保持斗争精神、增强斗争本领，年轻干部要到重大斗争中去真刀真枪干。

　　——2019年1月21日，在省部级主要领导干部坚持底线思维着力防范化解重大风险专题研讨班开班式上的讲话

　　●新征程上，不可能都是平坦的大道，我们将会面对许多重大挑战、重大风险、重大阻力、重大矛盾，领导干部必须有强烈的担当精神。

　　——2017年10月27日，在十九届中共中央政治局第一次集体学习时的讲话</p>
      </div>
    </slide>
  </div>
</template>

<script>
  import slide from '../lib/index'

  export default {
    data() {
      return {
        pics: [
          'https://m.360buyimg.com/n12/s750x750_jfs/t3205/78/6355048904/291608/441e877a/58a452adN80497df6.jpg!q70.jpg',
          'https://m.360buyimg.com/n12/jfs/t4105/47/2155533704/319583/53f79440/58a452adNc80be146.jpg!q70.jpg',
          'https://m.360buyimg.com/n12/jfs/t3121/156/6492473908/284095/b8160ca5/58a452adN9d9dbd1c.jpg!q70.jpg',
          'https://m.360buyimg.com/n12/jfs/t3241/59/6354264578/600889/6a343612/58a452aeN0e746eb0.jpg!q70.jpg',
          'https://m.360buyimg.com/n12/jfs/t3070/354/6352201488/462630/ae6f4309/58a452aeN7df0a937.jpg!q70.jpg'
        ],
        isFullscreen: false
      }
    },
    methods: {
      toggleFullscreen() {
        this.isFullscreen = !this.isFullscreen;
      },
      slideChange(index, prevIndex) {
        console.log(index);
      }
    },
    components: {
      slide
    }
  }
</script>

<style lang="scss">
  .example {
    position: fixed;
    left: 0;
    top: 0;
    bottom: 0;
    right: 0;
    width: 100%;
  }
  .vue-ui-slide {
    width: 100%;
    height: 100%;
  }
  .slide-content {
    height: 100%;
  }
  .slide-item {
    height: 100%;
    overflow: auto;
    box-sizing: border-box;
    -webkit-overflow-scrolling: touch;
    padding: 20px 50px;
  }
</style>
